[frmBackUpManager_cCMD]
2=反選(&I)
0=刪除(&E)
1=創建(&C)
[frmBackUpManager]
COK=還原(&R)
Caption=備份管理器
[frmBackUpManager_Label3]
1=備份的檔:
0=還原點:
[frmFactions_FraProps]
0=陣營屬性
[frmFactions_Frame1]
2=特性
1=關係
0=識別
[frmFactions_chkFlags]
0=永不顯示陣營標籤
[frmFactions_Label1]
5=等級:
6=*關係範圍(-1.0~1.0),實際遊戲中*100
4=關係:
2=陣營顏色:
0=陣營ID:
1=陣營名(EN):
3=陣營名(CNS):
[frmFactions]
CApply=套用(&A)
CReset=重置(&R)
COutputLine=輸出當前陣營(&O)
Label2=陣營數:
Label3=查詢:
Caption=陣營編輯器
[frmFactions_CQuery]
0=↓
1=↑
[frmFactions_cCMD]
0=刪除(&E)
1=創建(&C)
2=上移(&U)
3=下移(&D)
[frmItems]
COutputLine=輸出當前物品(&O)
CApply=套用(&A)
CReset=重置(&R)
Frame4=雜項
Frame5=陣營
ChkNext=下一個武器作為第二使用模式
Label7=充裕度:
Label6=價格:
FrmMod=模型
FrmAtt=裝備綁定
Frame6=首碼
Label43=模型名稱:
Label44=位置:
LbMdel=刪除
LbMadd=新增
FrmAct=動作
FrmChange=修改
ParamAdd=新建參數
actPaste=粘貼操作
trgPaste=粘貼觸發器
trgCopy=複製
actAdd=新建操作
trgDel=刪除
trgAdd=新建觸發器
FrmFlags=特性
Label4=傷害：
Label12=彈藥數量：
Label11=重量：
Label10=長度：
Label40=身防：
Label39=頭防：
Label38=腿防：
Label37=難度：
Label36=重量：
FrmOptDT=Frame3
FrmOptDT2=Frame4
Label31=重量：
Label30=尺寸：
Label29=速度：
Label28=強度：
Label26=抗擊：
Label32=長度：
Label27=精度：
Label18=彈量：
Label17=傷害：
Label16=彈速：
Label15=速度：
Label14=難度：
Label13=重量：
Label25=尺寸：
Label24=難度：
Label23=生命：
Label22=衝鋒：
Label21=操控：
Label20=防護：
Label19=速度：
Label35=食物品質：
Label34=重量：
Label33=數量：
Frame3=預置
LbTest=
Label2=物品數:
Label3=查詢:
Caption=物品編輯器
FraCalc=
[frmItems_CQuery]
0=↓
1=↑
[frmItems_FraProps]
0=FraProps0
2=FraProps2
3=FraProps3
1=FraProps1
[frmItems_Frame1]
0=物品類型
[frmItems_Option1]
0=無
20=書籍
1=馬匹
2=單手武器
3=雙手武器
4=長杆武器
5=箭
6=弩箭
7=盾牌
8=弓
9=弩
10=投擲武器
11=貨物
12=頭盔
13=鎧甲
14=鞋子
15=手套
16=手槍
17=步槍
18=子彈
19=動物
[frmItems_FrmType]
0=識別
[frmItems_Label1]
3=物品複數名(CNS):
0=物品ID:
1=物品名(EN):
2=物品名(CNS):
[frmItems_OptAtt]
3=強制綁定到左前臂
4=綁定到盔甲
0=無
1=強制綁定到左手
2=強制綁定到右手
[frmItems_trgCMD]
1=下移
0=上移
[frmItems_Frame2]
8=Null
4=彈藥屬性
7=護甲屬性
1=近戰武器屬性
5=盾牌屬性
2=遠端武器屬性
3=馬匹屬性
6=貨物、書本、動物屬性
0=首碼
[frmItems_OptADamR]
1=刺
2=鈍
0=砍
[frmItems_ChkDam]
0=
1=
[frmItems_OptDT]
1=刺傷
2=鈍傷
0=砍傷
[frmItems_OptDT2]
0=砍傷
2=鈍傷
1=刺傷
[frmItems_Label5]
3=速度:
2=難度:
0=重量:
1=長度:
[frmItems_OptDamR]
2=鈍
1=刺
0=砍
[frmItems_OptIMod]
16=投擲(重)
15=投擲
14=箭矢
13=弩
12=弓
11=鋤
10=劍(極品)
9=劍
8=斧頭
7=長杆
6=盾牌
5=金屬
17=自定義
4=護甲
3=衣服
2=好馬
1=馬匹
0=無
[frmItems_Tab1]
1=基本資訊(&I)
2=屬性(&P)
3=模型&動作(&M)
4=觸發器(&T)
[frmItems_cCMD]
3=下移(&D)
2=上移(&U)
0=刪除(&E)
1=創建(&C)
[frmLine]
CCopy=複製到剪切板(&C)
CApply=導入到編輯器(&A)
Caption=文本行
[frmMain_Label1]
1=備份劇本(&B)
0=保存劇本(&V)
[frmMap_Label1]
1=座標:
0=篩檢程式:
[frmMap_CCMD]
0=撤銷(&B)
1=套用(&A)
[frmMap]
chkInvertSelection=反選(&S)
Caption=卡拉迪亞地圖
[frmMap_chkLogic]
1=反向過濾(&I)
0=存在一項即匹配(&A)
[frmMap_Icons_FraProps]
0=圖示屬性
[frmMap_Icons_Frame1]
1=模型
3=偏移
2=特性
0=識別
[frmMap_Icons_Label1]
5=Z:
4=Y:
3=X:
2=比例:
1=網格名:
6=聲音:
0=圖示名:
[frmMap_Icons]
chkOffsets=
chkCustom=設置為自定義旗幟的大地圖圖示
CApply=套用(&A)
CReset=重置(&R)
COutputLine=輸出當前圖示(&O)
Label2=圖示數:
Label3=查詢:
Caption=大地圖圖示編輯器
[frmMap_Icons_chkFlags]
0=無陰影
[frmMap_Icons_CQuery]
0=↓
1=↑
[frmMap_Icons_cCMD]
0=刪除(&E)
1=創建(&C)
2=上移(&U)
3=下移(&D)
[frmMesh]
COutputLine=輸出當前網格模型(&O)
CApply=套用(&A)
CReset=重置(&R)
FraScale=尺寸
Label9=Z:
Label8=Y:
Label7=X:
FraRotation=旋轉
Label6=X軸:
Label5=Y軸:
Label4=Z軸:
FraTranslation=移動
Label27=Z軸:
Label26=Y軸:
Label25=X軸:
Frame1=基礎資訊
Label24=網格資源名:
Label1=網格模型名:
FraFlags=特性
Label2=網格模型數:
Label3=查詢:
Caption=網格編輯器
[frmMesh_CQuery]
0=↓
1=↑
[frmMesh_FraProps]
0=FraProps0
[frmMesh_Tab1]
1=基本資訊(&I)
[frmMesh_cCMD]
3=下移(&D)
2=上移(&U)
0=刪除(&E)
1=創建(&C)
[frmParamType]
CMDCancel=取消(&C)
CmdOK=確定(&O)
Caption=選擇參數類型
[frmParties_FraProps]
0=FraProps0
3=FraProps3
2=FraProps2
1=FraProps1
4=FraProps4
[frmParties_Frame1]
10=範本
2=觸發
0=識別
1=成員
9=其他特性
8=攜帶
6=識別
3=AI
4=個性
5=方向
7=位置
[frmParties_Label1]
24=部隊範本:
11=*此處可能已廢除，推薦設為0
15=菜單:
14=陣營:
3=部隊名(CNS):
1=部隊名(EN):
0=部隊ID:
23=可加入兵種:
10=數量:
7=物品數:
6=攜帶金額:
12=標籤:
5=圖示:
9=目標:
8=AI指令:
13=*勇氣8表示中立
4=侵略性:
2=勇氣:
22=東
21=西
19=南
18=北
17=角度(角度制):
16=縱坐標Y:
20=橫坐標X:
[frmParties]
chkSlave=俘虜
chkBanditness=土匪強盜
Command1=打開卡拉迪亞地圖(&M)
COutputLine=輸出當前部隊(&O)
CReset=重置(&R)
CApply=套用(&A)
Label3=查詢:
Label2=部隊數:
Caption=部隊編輯器
[frmParties_chkFlags]
16=平民
15=不攻擊平民
14=不可見
13=顯示陣營
8=在城鎮中自動去除
12=藏身處
7=行為默認
6=總是可見
11=人數有限
10=無標籤
2=靜態
1=船
0=不可用
9=任務特設
[frmParties_OptLabelSize]
2=大
1=中
0=小
[frmParties_CQuery]
1=↑
0=↓
[frmParties_Tab1]
1=基本屬性(&P)
2=行為(&A)
3=特性(&E)
4=成員(&M)
5=初始設定(&I)
[frmParties_cCMD]
3=下移(&D)
2=上移(&U)
1=創建(&C)
0=刪除(&E)
[frmParty_Templates_FraProps]
3=FraProps3
2=FraProps2
0=FraProps0
1=FraProps1
[frmParty_Templates_Frame1]
1=成員
9=其他特性
8=攜帶
6=識別
2=觸發
0=識別
4=個性
[frmParty_Templates]
chkSlave=俘虜
chkBanditness=土匪強盜
COutputLine=輸出當前範本(&O)
CReset=重置(&R)
CApply=套用(&A)
Label3=查詢:
Label2=範本數:
Caption=部隊範本編輯器
[frmParty_Templates_Label1]
23=可加入兵種:
10=最少:
9=最多:
7=物品數:
6=攜帶金額:
12=標籤:
5=圖示:
11=*此處可能已廢除，推薦設為0
15=菜單:
14=陣營:
3=範本名(CNS):
1=範本名(EN):
0=部隊範本ID:
13=*勇氣8表示中立
4=侵略性:
2=勇氣:
[frmParty_Templates_chkFlags]
16=平民
15=不攻擊平民
14=不可見
13=顯示陣營
8=在城鎮中自動去除
12=藏身處
7=行為默認
6=總是可見
11=人數有限
10=無標籤
2=靜態
1=船
0=不可用
9=任務特設
[frmParty_Templates_OptLabelSize]
2=大
1=中
0=小
[frmParty_Templates_CQuery]
1=↑
0=↓
[frmParty_Templates_Tab1]
1=基本屬性(&P)
2=行為(&A)
3=特性(&E)
4=成員(&M)
[frmParty_Templates_cCMD]
3=下移(&D)
2=上移(&U)
1=創建(&C)
0=刪除(&E)
[frmPSys]
COutputLine=輸出當前粒子系統(&O)
CApply=套用(&A)
CReset=重置(&R)
FraAttr=屬性
Label30=震盪強度:
Label29=震盪大小:
Label28=重力:
Label27=阻尼:
Label26=粒子壽命:
Label25=粒子數量:
Frame1=基礎資訊
Label24=模型名:
Label1=粒子系統名:
FraFlags=特性
Frame3=旋轉
Label39=旋轉阻尼:
Label32=旋轉速度:
FraEmit=噴射
FraESpd=噴射初速度:
Label38=X:
Label37=Z:
Label36=Y:
FraEBox=噴射區域:
Label35=Y:
Label34=Z:
Label31=X:
Label33=噴射路徑隨機性:
FraKey=變化
Label23=大小:
Label22=時間:
Label21=時間:
Label20=大小:
Label19=時間:
Label18=大小:
Label17=大小:
Label16=時間:
Label15=大小:
Label14=時間:
Label13=時間:
Label12=大小:
Label11=時間:
Label10=大小:
Label9=大小:
Label8=時間:
Label4=時間:
Label5=大小:
Label6=大小:
Label7=時間:
Label2=粒子系統數:
Label3=查詢:
Caption=粒子系統編輯器
[frmPSys_CQuery]
0=↓
1=↑
[frmPSys_FraProps]
0=FraProps0
1=FraProps1
[frmPSys_FraScale]
1=尺寸鍵2
0=尺寸鍵1
[frmPSys_FraBlue]
1=藍鍵2
0=藍鍵1
[frmPSys_FraGreen]
1=綠鍵2
0=綠鍵1
[frmPSys_FraRed]
1=紅鍵2
0=紅鍵1
[frmPSys_FraAlpha]
0=阿爾法鍵1
1=阿爾法鍵2
[frmPSys_Frame2]
8=Null
[frmPSys_Tab1]
1=基本資訊(&I)
2=效果(&S)
[frmPSys_cCMD]
3=下移(&D)
2=上移(&U)
0=刪除(&D)
1=創建(&C)
[frmSaveAs]
CStart=保存(&S)
Caption=另存為
[frmSaveAs_Label1]
3=劇本名:
[frmScenes_FraProps]
0=FraProps0
1=FraProps1
2=FraProps2
[frmScenes_Frame1]
3=外景
9=模型
0=識別
2=箱子
6=基本設置
8=左上角
7=右下角
1=特性
[frmScenes_Label1]
4=類型:
16=表面代碼:
17=碰撞模型名:
18=網格名:
0=場景ID:
1=場景名(EN):
14=縱坐標Y:
13=橫坐標X:
12=橫坐標X:
11=縱坐標Y:
15=水面高度:
[frmScenes_chkFlags]
6=水渾濁
5=禁止馬進入
4=隨機產生入口
3=隨機產生地形生成器的密鑰
2=通過地形生成器產生地形
0=室內場景
1=強制使用天空貼圖(無視是否室內場景)
[frmScenes]
CApply=套用(&A)
CReset=重置(&R)
COutputLine=輸出當前場景(&O)
Label2=場景數:
Label3=查詢:
Caption=場景編輯器
[frmScenes_CQuery]
0=↓
1=↑
[frmScenes_Tab1]
1=基本屬性(&P)
2=場景設定(&S)
3=特性(&E)
[frmScenes_cCMD]
0=刪除(&E)
1=創建(&C)
2=上移(&U)
3=下移(&D)
[frmSelectPath_COK]
1=確定(&O)
0=確定(&O)
[frmSelectPath_Label1]
7=*語言名為程式目錄下的lan.ini檔的檔案名
5=編輯器語言:
3=安裝路徑:
0=版本:
1=*請去除版本號中的".",
2=例如1.134,則改為1134。
4=語言:
6=(如:cns.lan.ini則填入cns)
[frmSelectPath_Label2]
1=編輯器設置(&E)
0=戰團設置(&W)
[frmSelectPath]
CReg=添加到註冊表(&R)
Caption=選擇戰團安裝目錄
[frmSoundRess_FraProps]
0=聲音資源屬性
[frmSoundRess_Frame1]
2=特性
0=識別
[frmSoundRess_chkFlags]
2=隨機播放
1=迴圈播放
0=2D聲效
[frmSoundRess_Label1]
2=音量:
1=優先順序:
0=資源名:
[frmSoundRess]
CApply=套用(&A)
CReset=重置(&R)
COutputLine=輸出當前資源(&O)
Label2=資源數:
Label3=查詢:
Caption=聲音資源編輯器
[frmSoundRess_CQuery]
0=↓
1=↑
[frmSoundRess_cCMD]
0=刪除(&E)
1=創建(&C)
2=上移(&U)
3=下移(&D)
[frmSounds_FraProps]
0=聲音屬性
[frmSounds_Frame1]
1=聲音資源
2=特性
0=識別
[frmSounds_Label1]
6=資源:
2=音量:
1=優先順序:
0=聲音名:
[frmSounds_chkFlags]
2=隨機播放
1=迴圈播放
0=2D聲效
[frmSounds]
CApply=套用(&A)
CReset=重置(&R)
COutputLine=輸出當前聲音(&O)
Label2=聲音數:
Label3=查詢:
Caption=聲音編輯器
[frmSounds_CQuery]
0=↓
1=↑
[frmSounds_cCMD]
0=刪除(&E)
1=創建(&C)
2=上移(&U)
3=下移(&D)
[frmTabMat]
COutputLine=輸出當前可變素材(&O)
CApply=套用(&A)
CReset=重置(&R)
FrmChange=修改
OpBlocksDel=刪除
ActCopy=複製操作
actPaste=粘貼操作
ParamAdd=新建參數
actAdd=新建操作
FraEmit=屬性
Frame1=基礎資訊
Label24=樣本名:
Label1=可變素材名:
FraFlags=特性(暫不可用)
LbTest=
Label2=可變素材數:
Label3=查詢:
Caption=可變素材編輯器
FraCalc=
[frmTabMat_CQuery]
0=↓
1=↑
[frmTabMat_FraProps]
1=FraProps1
0=FraProps0
[frmTabMat_Frame2]
8=Null
[frmTabMat_OpBlocksCMD]
0=上移
1=下移
[frmTabMat_FraEBox]
2=網格最大值:
1=網格最小值:
0=尺寸:
[frmTabMat_Label31]
2=X:
1=X:
0=高:
[frmTabMat_Label35]
2=Y:
1=Y:
0=寬:
[frmTabMat_Tab1]
1=基本資訊(&I)
2=操作塊(&S)
[frmTabMat_cCMD]
3=下移(&D)
2=上移(&U)
0=刪除(&D)
1=創建(&C)
[frmTroops_FraProps]
2=FraProps2
0=FraProps0
3=FraProps3
1=FraProps1
4=FraProps4
[frmTroops_Frame1]
9=其他特性
8=武器特性
6=性別
5=武器熟練度
2=技能
1=屬性
0=識別
3=識別
7=初始場景
4=升級
10=面容代碼
[frmTroops_chkFlags]
15=不能作為駐兵
7=隨機相貌
6=商隊
5=騎馬
4=無法活捉
2=只能擊暈
1=非現役
0=NPC英雄
3=死亡
14=保證有遠端武器
13=保證有盾
12=保證有馬
11=保證戴手套
10=保證戴頭盔
9=保證穿盔甲
8=保證穿鞋子
[frmTroops_OptSex]
0=男
1=女
2=其他
[frmTroops_Label1]
18=火器:
17=投擲:
16=弩:
15=弓箭:
13=長杆:
12=雙手:
10=單手:
9=等級:
8=力量:
7=敏捷:
6=智力:
5=魅力:
4=兵種複數(CNS):
3=兵種名(CNS):
2=兵種複數(EN):
1=兵種名(EN):
0=兵種ID:
25=擁有物品:
24=可選擇物品:
14=陣營:
22=具體站位:
11=升級成:
21=面容2:
19=面容1:
23=*面部代碼請在編輯模式下按Ctrl+E獲取。代碼位置如圖所示:
[frmTroops_CQuery2]
0=↓
1=↑
[frmTroops]
Label4=查詢:
COutputLine=輸出當前兵種(&O)
CReset=重置(&R)
CApply=套用(&A)
Label3=查詢:
Label2=兵種數:
Caption=兵種編輯器
[frmTroops_bCMD]
4=全不選(&C)
0=刪除(&E)
1=↓添加所選物品(&A)
2=上移(&U)
3=下移(&D)
[frmTroops_CQuery]
1=↑
0=↓
[frmTroops_Tab1]
1=基本屬性(&P)
2=關係設定(&S)
3=特性(&E)
4=物品欄(&I)
5=面容(&F)
[frmTroops_cCMD]
3=下移(&D)
2=上移(&U)
1=創建(&C)
0=刪除(&E)
[Welcome]
chkDisplayMode=Check1
Label2=啟動可調表單模式
CSelectPath=設置(&E)
CStart=開始編輯(&S)
Caption=騎馬與砍殺:戰團 劇本編輯器
[Welcome_Label1]
3=選擇劇本:
2=戰團版本:[Version]
[frmMain]
mFile=文件(&F)
mSelectMod=選擇劇本(&M)
mSave=保存劇本(&S)
mBackUp=備份劇本(&B)
mSaveAs=另存為劇本(&A)
mQuit=退出(&X)
mWindows=窗口(&W)
mDisplayMode=可調表單模式(&S)
mAdvance=高級功能(&A)
mInitTranslateForms=導出表單語言(&O)
mEditor=編輯器(&E)
mTool=工具(&T)
mHelp=?明(&H)
mHelpTheme=幫助主題(&H)
mTutorials=修改教程(&T)
mDash2=-
mAbout=關於MnBWarband Editor(&A)
Caption=劇本:[ModName]
mIndex=【魔球教程索引貼】
[frmMain_mDash]
0=-
[frmMain_mEditors]
0=編輯器
1=兵種
2=物品
3=部隊
4=部隊範本
5=陣營
6=場景
7=大地圖圖示
8=粒子系統
9=聲音
10=聲音資源
11=可變素材
12=網格模型
[frmMain_mTools]
0=工具
1=卡拉迪亞地圖
2=備份管理器
3=物品導入嚮導
[frmMain_mTutorial]
0=用魔球輕鬆修改出火劍
1=用魔球導入一把火槍
2=通過魔球粒子系統編輯器製作藍色火劍
3=用魔球製作火箭
4=用魔球製作一件紋章甲
[PublicTags]
0=保留
1=寄存器
2=總體變數
3=字串
4=物品
5=兵種
6=陣營
7=任務
8=部隊範本
9=部隊
10=場景
11=任務範本
12=菜單
13=腳本
14=粒子系統
15=場景道具
16=聲音
17=局部變數
18=大地圖圖示
19=技能
20=網格模型
21=展示
22=快速字串
23=曲目
24=可變材質
25=動畫
26=關鍵字結束
[PublicEditors]
0=編輯器
1=兵種
2=物品
3=部隊
4=部隊範本
5=陣營
6=場景
7=大地圖圖示
8=粒子系統
9=聲音
10=聲音資源
11=可變素材
12=網格模型
[PublicEditors_Simplified]
0=編輯器
1=兵種
2=物品
3=部隊
4=範本
5=陣營
6=場景
7=圖示
8=粒子系統
9=聲音
10=資源
11=可變素材
12=網格模型
[PublicTools]
0=工具
1=卡拉迪亞地圖
2=備份管理器
3=物品導入嚮導
[PublicHelp]
0=?明
1=關於
[PublicTips]
0=(無)
1=載入中,請稍候...
2=創建模組中,請稍候...
3=複製資源中,請稍候...
4=保存中,請稍候...
5=導入中,請稍候...
[PublicMsgs]
0=提示
1=確定套用當前設置?
2=是否刪除[[str0]]?
3=刪除[str0]
4=[[str0]]是必要成分,無法刪除!
5=是否參照[[str0]]來創建新[str1]?
6=關係
7=[[str0]]是必要成分,無法移動!
8=移動[str0]
9=創建新[str0]
10=確定重置當前設置?
11=沒找到更多匹配項!
12=查詢
13=序列
14=名
15=確定導出表單語言?
16=表單語言已成功導出到new.lan.ini中!點擊確定後程式將重啟。
17=確定要創建一個時間標注的還原點嗎?
18=[str0]最多只能有[str1]!
19=錯誤!
20=創建還原點失敗!請確保備份劇本的完整性!
21=創建成功!備份檔案夾在[[str0]]
22=確定退出 【騎馬與砍殺:戰團】劇本編輯器 嗎?
23=確認退出
24=確定按現在設定保存劇本[[str0]]?
25=保存劇本
26=點數
27=請確認備份劇本[[str0]]後,按“確定”開始保存。
28=上一武器的第二種攻擊模式
29=劇本[[str0]]保存成功!
30=輸出窗口:[[str0]]
31=技能
32=選擇劇本
33=確定要重新選擇劇本?
34=刪除還原點
35=確定要刪除所選還原點嗎?
36=創建一個還原點
37=確定要創建一個時間標注的還原點嗎?
38=參數
39=參數必須是整型!
40=還原
41=確定要還原[[str0]]嗎?
42=保留
43=還原成功!
44=還原失敗!
45=超出兵種擁有物品限制(64)!添加失敗!
46=數量
47=俘虜
48=最少
49=最多
50=劇本:[str0]
51=另存為
52=劇本[[str0]]保存成功!
53=所輸入的劇本名不合法!
54=無法識別
55=座標
56=不能揮砍
57=不能穿刺
58=請先複製操作!
59=請選擇要粘貼的操作所在的觸發器!
60=至少要有一個模型!
61=此物品不能編輯
62=請選擇要創建參數所在的操作!
63=這個操作不能新建參數!
64=物品所屬陣營不存在,將設為無陣營
65=觸發器
66=條件
67=執行
68=操作
69=[str0][str1][str2][str3]中[str4]不存在,將被設為[str4](0)!
70=操作只能選擇!
71=不存在該條件!
72=請選擇要添加的操作所在的觸發器!
73=參數不合法!
74=此項不能移動!
75=請選擇要移動的操作!
76=物品觸發器已複製
77=操作已複製
78=此項不能複製!
79=請選擇要複製的觸發器或操作!
80=確定要刪除該觸發器麼?
81=確定要刪除該操作麼?
82=至少要有一個操作!
83=必選參數不能刪除!
84=可選參數只能從最後一個刪除!
85=此項不能刪除!
86=未選中任何專案!
87=請先複製物品觸發器!
88=值
89=驅動器錯誤
[PublicSkills]
0=交易
1=統禦
2=俘虜管理
3=
4=
5=
6=
7=說服力
8=工程學
9=急救
10=手術
11=療傷
12=物品管理
13=偵察
14=嚮導
15=戰術
16=跟蹤
17=教練
18=
19=
20=
21=
22=掠奪
23=騎射
24=騎術
25=跑動
26=盾防
27=武器掌握
28=
29=
30=
31=
32=
33=強弓
34=強擲
35=強擊
36=鐵骨
37=
38=
39=
40=
41=
[frmItems_LstFlags]
0=獨一無二
1=總是戰利品
2=不能格擋
3=默認彈藥
4=商品
5=木質攻擊
6=木質格擋
7=食物
8=不能在馬上裝填
9=不能持盾
10=主要武器
11=次要武器
12=遮蓋腳部/不覆蓋頭髮/可以穿透盾牌
13=消耗品
14=對盾加成
15=持盾時傷害減少
16=不能在馬上使用
17=民用/下個物品作為第二攻擊模式
18=吻合頭部/衝刺時握持武器位置偏後
19=遮蓋頭部/可以發動長槍衝刺
20=破格擋
21=Knock_Back
22=卸下正在使用的物品
23=非平衡武器
24=遮蓋面部
25=不能拾起
26=可以擊倒敵人
[frmItems_LstAction]
0=單手武器直刺
1=單手武器豎劈
2=單手武器右揮
3=單手武器左揮
4=雙手武器直刺
5=雙手武器豎劈
6=雙手武器右揮
7=雙手武器左揮
8=長杆武器直刺
9=長杆武器豎劈
10=長杆武器右揮
11=長杆武器左揮
12=在馬背上單手直刺
13=在馬背上右邊單手豎劈
14=在馬背上左邊單手豎劈
15=在馬背上單手右揮
16=在馬背上單手左揮
17=在馬背上揮舞長杆
18=騎槍單手直刺
19=在馬背上騎槍單手直刺
20=單手格擋直刺
21=單手格擋豎劈
22=單手右格擋
23=單手左格擋
24=雙手格擋直刺
25=雙手格擋豎劈
26=雙手右格擋
27=雙手左格擋
28=長杆格擋直刺
29=長杆格擋豎劈
30=長杆右格擋
31=長杆左格擋
32=顯示劍鞘
33=弓射擊
34=標槍射擊
35=弩射擊
36=投擲石子
37=投擲飛刀
38=投擲飛斧
39=投擲標槍
40=手槍射擊
41=步槍射擊
42=將劍背在左臀部
43=將劍背在背後
44=將斧頭背在左臀部
45=將斧頭背在背後
46=攜帶長矛
47=將飛刀戴在左前
48=將飛刀戴在右前
49=將箭筒戴在右前
50=將箭筒戴在右後
51=將箭筒垂直戴在右邊
52=將箭筒戴在背後
53=將左輪手槍戴在右邊
54=將手槍戴在左前
55=將弓袋戴在左邊
56=將錘頭戴在左臀部
57=攜帶箏形盾
58=攜帶圓盾
59=將小圓盾戴在左邊
60=攜帶闊盾
61=將弩背在背後
62=將弓背在背後
63=攜帶太刀
64=攜帶脅指
65=手槍裝填
66=步槍裝填
[frmPSys_LstFlags]
0=總是存在
1=全場景存在
2=水面爆出
3=Billboard Drop
4=2D平面效果
5=3D平面效果
6=Turn to Velocity
7=隨機旋轉
8=隨機尺寸
9=2D震盪
[frmTip]
Caption=提示
Label1=Label1
[frmMap_LstFilter]
0=不可用
1=船
2=靜態
3=總是可見
4=行為默認
5=在城鎮中自動去除
6=任務特設
7=無標籤
8=人數有限
9=藏身處
10=顯示陣營
11=不可見
12=不攻擊平民
13=平民
[frmItems_CBixmesh]
0=主模型
1=物品欄模型
2=飛行模型
3=攜帶模型
[Operation0]
Name=運行腳本
1=腳本
[Operation1]
Name=播放聲音
1=聲音
[Operation2]
Name=播放曲目
1=音樂
2=可選參數(0=默認,1=當前曲目淡出,2=停止當前曲目)
[Operation3]
Name=播放提示曲目
1=音樂
[Operation4]
Name=Position_Move_X
1=位置
2=位移量
3=可選參數(0=本地,1=全局)
[Operation5]
Name=Position_Move_Y
1=位置
2=位移量
3=可選參數(0=本地,1=全局)
[Operation6]
Name=Position_Move_Z
1=位置
2=位移量
3=可選參數(0=本地,1=全局)
[Operation7]
Name=設置當前顏色
1=Red
2=Green
3=Blue
[Operation8]
Name=Set_Position_Delta
1=X
2=Y
3=Z
[Operation9]
Name=創建點光源
1=數量(可選參數)
2=間隔(1/100秒)[可選參數]
[Operation10]
Name=創建點光源到實體
1=數量(可選參數)
2=間隔(1/100秒)[可選參數]
[Operation11]
Name=粒子系統(新建)
1=粒子系統
2=位置(可選參數)
[Operation12]
Name=粒子系統(emit)
1=粒子系統
2=粒子數量
3=週期
[Operation13]
Name=粒子系統(Burst)
1=粒子系統
2=位置
3=粒子數量(可選參數)
[Operation14]
Name=儲存觸發器參數1
1=參數
[Operation15]
Name=儲存觸發器參數2
1=參數
[Operation16]
Name=儲存觸發器參數3
1=參數
[Operation17]
Name=Try_Begin
1=參數
2=參數
[Operation18]
Name=Try_End
[Operation19]
Name=Else_Try
[Operation20]
Name=Try_for_Range
1=變數
2=下界
3=上界
[Operation21]
Name=Try_for_Range_Backwards
1=變數
2=上界
3=下界
[Operation22]
Name=大於或等於
1=參數
2=參數
3=下界
[Operation23]
Name=等於
1=參數
2=參數
[Operation24]
Name=大於
1=參數
2=參數
[Operation25]
Name=在...之間
1=值
2=下界
3=上界
[Operation26]
Name=獲得玩家角色ID
1=變數
[Operation27]
Name=相加(值)
1=變數
2=運算元
[Operation28]
Name=相減(值)
1=變數
2=運算元
[Operation29]
Name=相乘(值)
1=變數
2=運算元
[Operation30]
Name=相除(值)
1=變數
2=運算元
[Operation31]
Name=取模(值)
1=變數
2=運算元
[Operation32]
Name=最小(值)
1=變數
2=運算元
[Operation33]
Name=最大(值)
1=變數
2=運算元
[Operation34]
Name=鉗(值)
1=變數
2=上界
3=下界
[Operation35]
Name=絕對值(值)
1=變數
2=上界
3=下界
[Operation36]
Name=或(值)
1=變數
2=運算元
[Operation37]
Name=與(值)
1=變數
2=運算元
[Operation38]
Name=開根(儲存)
1=變數
2=運算元
[Operation39]
Name=或(儲存)
1=變數
2=運算元1
3=運算元2
[Operation40]
Name=與(儲存)
1=變數
2=運算元1
3=運算元2
[Operation41]
Name=取模(儲存)
1=變數
2=運算元1
3=運算元2
[Operation42]
Name=相加(儲存)
1=變數
2=運算元1
3=運算元2
[Operation43]
Name=相減(儲存)
1=變數
2=運算元1
3=運算元2
[Operation44]
Name=相乘(儲存)
1=變數
2=運算元1
3=運算元2
[Operation45]
Name=相除(儲存)
1=變數
2=運算元1
3=運算元2
[Operation46]
Name=當前可變素材設定背景色
1=顏色值
[Operation47]
Name=當前可變素材增加網格
1=網格模型
2=位置
3=尺寸修正值
4=Alpha修正值
[Operation48]
Name=當前可變素材增加帶頂點顏色的網格
1=網格模型
2=位置
3=尺寸修正值
4=Alpha修正值
5=頂點顏色(0為默認顏色)
[Operation49]
Name=Position_Set_X
1=位置
2=修正值
[Operation50]
Name=Position_Set_Y
1=位置
2=修正值
[Operation51]
Name=Position_Set_Z
1=位置
2=修正值
[tiOn]
0=初始化物品
1=武器攻擊
2=箭矢擊中
[PublicWizards]
0=下一步>(&N)
1=<上一步(&F)
2=取消(&C)
3=完成(&F)
4=導入成功
5=導入失敗
6=錯誤報告
7=導入物品txt信息(item_kinds1.txt)
8=選擇需導入裝備的檔夾
9=導入物品語言資訊(item_kinds.csv)
10=確定導入物品
11=導入物品報告(共[str0]項):
12=導入模型報告(共[str0]項):
13=導入貼圖報告(共[str0]項):
14=[未找到]
15=貼圖文件
16=模型檔
17=無任何txt讀入!導入嚮導將不會產生相應物品,需要您自己在[物品編輯器]裏手動添加。是否繼續下一步?
18=無任何語言資訊讀入!是否繼續下一步?
19=請將需導入的物品的txt行複製進下面的文本框,如果沒有,請直接點擊[下一步]。
20=請選擇需要導入的裝備的檔夾,
21=確保該文件夾下有Textures(貼圖)和Resource(模型)檔夾,
22=並確認其中分別有DDS、BRF檔。
23=如果您的這兩種檔不是這樣存放的,
24=也請您按此存放以確保導入的正常進行。
25=請將需導入的物品的語言資訊(可在下方文本框裏設置)複製進下麵的文本行,
26=如果沒有,請直接點[下一步]。
27=導入的資訊已設置,查看下列設置報告,如有誤，點擊[上一步]返回修改；確認正確,點擊[下一步]啟動導入程式。
28=物品已成功導入,
29=您可以在[物品編輯器]裏隨時修改它們。請記得在關閉編輯器前[保存劇本]以使導入生效。
30=但是由於沒有txt行,嚮導無法創建相應物品。您可以在[物品編輯器]裏創建新物品,並把該物品的模型設為剛導入的模型。
31=導入過程中斷!請確認模型檔的正確性,txt文本的正確性,以及語言資訊的正確性!點擊[上一步]返回修改。
[PublicAbout]
0=參與人員:
1=主程序:SSgt_Edward,Ser_Charles
2=美工:我不是個過客(hp_honey)
3=各個編輯器、工具負責人:
4=MnBWarband Editor介紹:
5=[MnBWarband Editor]編輯器是一款用於查看、修改[騎馬與砍殺:戰團]這款遊戲的免費共用軟體。
6=它是由騎砍中文站的[騎馬砍殺TXT編輯器](kevin,kiss2003,mafei82394) 經過移植並完善而來(引用了7個模組),
7=在新增了[陣營]、[場景]、[部隊]、[大地圖圖示]、[粒子系統]、[聲音]、[聲音資源]、[可變素材]編輯器以及
8=[卡拉迪亞地圖]、[備份管理器]、[物品導入嚮導]工具的同時,
9=完善了原有的[兵種]、[物品]、[部隊範本]編輯器,使用戶能自由地修改自己的模組。
10=注意:
11=MnBWarband Editor在戰團1.132環境下編寫並經過測試。
12=聲明:
13=在MnBWarband Editor版本穩定之後,會開放源代碼(VB)。
14=特別感謝:
15=感謝騎砍中文站的kevin,kiss2003,mafei82394開放了[騎馬砍殺TXT編輯器]的源代碼
16=感謝騎砍中文站[騎馬與砍殺MOD製作教程－中文版]的漢化組為我們帶來的MOD教程
17=聯繫我們:
18=E-mail:ce1992620@yahoo.com.cn
19=       ce19920620@gmail.com
20=QQ:1061675615
21=   825312405
22=魔球討論群:74195097
23=歡迎隨時將您遇到的使用問題、Bug告訴我們,幫助我們完善MnBWarband Editor!
24=兵種:SSgt_Edward
25=物品:Ser_Charles
26=部隊:SSgt_Edward
27=部隊範本:SSgt_Edward
28=陣營:SSgt_Edward
29=場景:SSgt_Edward
30=大地圖圖示:SSgt_Edward
31=卡拉迪亞地圖:SSgt_Edward
32=粒子系統:Ser_Charles
33=可變素材:Ser_Charles
34=聲音:SSgt_Edward
35=聲音資源:SSgt_Edward
36=備份管理器:SSgt_Edward
37=物品導入嚮導:SSgt_Edward
[frmItems_OptHex]
2=二進位
1=16進制
0=十進位
[frmItems_ChkNEG]
0=非
1=或
[frmItems_Label8]
1=穿刺:
0=揮砍:
[frmTabMat_OptHex]
0=十進位
1=16進制
2=二進位
[frmTabMat_ChkNEG]
1=或
0=非
